void main() {
// 1) Выведите столбец чисел от 1 до 100.
  int a1 = 1;

  while (a1 <= 33) {
    print(a1);
    a1++;
  }
// 2) Выведите столбец чисел от 11 до 33.
  int a2 = 11;

  while (a2 <= 33) {
    print(a2);
    a2++;
  }

// 3) Выведите столбец четных чисел в промежутке от 0 до 100.

  int a3 = 0;

  while (a3 <= 100) {
    
    if (a3 % 2 == 0 && a3 != 0) {
      print(a3);
    }
    a3++;
  }

// 4) С помощью цикла найдите сумму чисел от 1 до 100.

  int i = 1;
  int sum = 0;
  while (i <= 100) {
    sum += i;
    i++;
  }
  print(sum);
}
